package relations

const (
	CUS_ERR_1000 = "用户名已被占用"
	CUS_ERR_1001 = "用户名或密码不可为空"

	CUS_ERR_1003 = "身份证格式错误或已使用"
	CUS_ERR_1004 = "未预留邮件或邮件地址格式错误"
	CUS_ERR_1005 = "未预留手机号或手机号码格式错误"
	CUS_ERR_1006 = "每天重置密码最多3次，您已重置3次"
	CUS_ERR_1007 = "用户数据不匹配"

	CUS_ERR_1008 = "设置数据失败	"
	CUS_ERR_1009 = "读取ttl失败，请稍后再试"
	CUS_ERR_1010 = "用户不存在"
	CUS_ERR_1011 = "该账号为锁定状态"
	CUS_ERR_1012 = "读取用户数据失败"
	CUS_ERR_1013 = "用户不存在或信息不完整"

	CUS_ERR_1015 = "该账号暂未激活"
	CUS_ERR_1016 = "该邮箱与您注册填写邮箱不一致"
	CUS_ERR_1017 = "用户名不可为中文"
	CUS_ERR_1018 = "该手机号已被其他用户注册使用"

	CUS_ERR_1021 = "用户名为6-20位英文加数字"
	CUS_ERR_1022 = "系统不支持超过200字符的邮箱地址"

	CUS_ERR_1101 = "新建用户失败"

	CUS_ERR_1103 = "设置用户账号状态时出现错误"
	CUS_ERR_1104 = "读取用户账号状态时出现错误"
	CUS_ERR_1105 = "解析用户资料时出现错误"
	CUS_ERR_1106 = "原始密码不正确"
	CUS_ERR_1107 = "创建用户Tokens失败"
	CUS_ERR_1108 = "读取用户Tokens失败"
	CUS_ERR_1109 = "该版块不支持该类用户"
	CUS_ERR_1110 = "证件列表为空或超过20条"

	CUS_ERR_1201 = "读取权限残表失败"
	CUS_ERR_1202 = "验证权限列表格式失败"
	CUS_ERR_2021 = "上传文件格式错误"
	CUS_ERR_2022 = "上传文件尺寸不能大于4M,请调节相机分辨率"
	CUS_ERR_2023 = "同时上传文件数量不能超过5个"

	CUS_ERR_2025 = "验证码已超时失效"
	CUS_ERR_2026 = "验证码不存在或已失效"
	CUS_ERR_2027 = "验证码不正确"
	CUS_ERR_3011 = "原始数据有误"
	CUS_ERR_3211 = "索取发票填写信息不完整"

	CUS_ERR_3302 = "微信支付缺少Ip信息"
	CUS_ERR_3303 = "微信支付缺少AuthCode信息"

	CUS_ERR_4001 = "表单参数错误"
	CUS_ERR_4002 = "请求参数错误"
	CUS_ERR_4003 = "您没有相应的权限"
	CUS_ERR_4004 = "参数错误，未找到原始数据"
	CUS_ERR_4005 = "本数据存在子集，无法删除"
	CUS_ERR_4006 = "返回值不正确"
	CUS_ERR_4008 = "缺少必要参数，请返回重试"
	CUS_ERR_4011 = "新增数据失败！"
	CUS_ERR_4012 = "更新数据失败！"
	CUS_ERR_4013 = "删除数据失败！"
	CUS_ERR_4014 = "该类型数据不可删除！"
	CUS_ERR_4015 = "请勿重复操作"
	CUS_ERR_4016 = "数据已添加成功，但权限更新失败"

	CUS_ERR_4100 = "不支持的格式"
	CUS_ERR_4101 = "不支持的文件类型"
	CUS_ERR_4102 = "文件无后缀或多重后缀"
	CUS_ERR_4301 = "获取文件地址失败"

	CUS_ERR_5001 = "缺少必要的值"
	CUS_ERR_5002 = "密码为8位以上由英文字母加数字加特殊符号组成"

	CUS_ERR_6001 = "信息发送失败，信息不完整，或账号信息有误"

	CUS_ERR_6003 = "信息发送失败，验证口令失败"

	CUS_ERR_7001 = "获取二维码失败，请稍后再试"
	CUS_ERR_7002 = "该账号已被绑定，请先解绑后再重新绑定"
	CUS_ERR_7004 = "该微信已绑定账号，请先解绑后再重新绑定"
	CUS_ERR_7003 = "该账号未绑定，或查询出错"
	CUS_ERR_7005 = "账号绑定失败，请稍后重试"
)
