package relations
const (
	CUS_ERR_1009 = "读取ttl失败，请稍后再试"
	CUS_ERR_1010 = "用户不存在"
	CUS_ERR_1019 = "账号绑定失败,请稍后再试"
	CUS_ERR_1020 = "账号异常，无法使用第三方登录，请稍后重试，或重新注册"
	CUS_ERR_1011 = "该账号为锁定状态"

	CUS_ERR_1102 = "用户不匹配"



	CUS_ERR_2021 = "上传文件格式错误"
	CUS_ERR_2022 = "上传文件尺寸不能大于4M,请调节相机分辨率"
	CUS_ERR_2023 = "同时上传文件数量不能超过5个"


	CUS_ERR_2025 = "验证码已超时失效"
	CUS_ERR_2026 = "验证码不存在或已失效"
	CUS_ERR_2027 = "验证码不正确"




	CUS_ERR_3211 = "索取发票填写信息不完整"



	CUS_ERR_3302 = "微信支付缺少Ip信息"
	CUS_ERR_3303 = "微信支付缺少AuthCode信息"




	CUS_ERR_4001 = "表单参数错误"
	CUS_ERR_4002 = "请求参数错误"
	CUS_ERR_4003 = "您没有相应的权限"
	CUS_ERR_4004 = "参数错误，未找到原始数据"

	CUS_ERR_4006 =  "返回值不正确"
	CUS_ERR_4007 =  "当前服务忙"
	CUS_ERR_4008 =  "缺少必要参数，请返回重试"

	CUS_ERR_4100 = "不支持的格式"
	CUS_ERR_4101 = "不支持的文件类型"
	CUS_ERR_4102 = "文件无后缀或多重后缀"
	CUS_ERR_4301 = "获取文件地址失败"




	CUS_ERR_6001 = "信息发送失败，信息不完整，或账号信息有误"

	CUS_ERR_6003 = "信息发送失败，验证口令失败"

	CUS_ERR_7001 = "获取二维码失败，请稍后再试"
)
